const li_MKBC_H=[
    createGames("H1　★1" , gameURL("317860246","","")+gameDesMKRS(`250`,`床、ジャンプ床`,
            difficulty("　通常","MKRSstar",1)+
            difficulty("全回収","none",0)
        ,`
            ついに復活!　今回はだいぶ簡単　だって1だから。<br>
            結構初心者向けのコース。遊び方はほぼリミ元と同じ。作者は流石に初見クリアした。(流石に...ね?)
        `,``
        ,`[東方] 上海紅茶館`)
    ),

    createGames("H2　★1" , gameURL("521275850","","")+gameDesMKRS(`265`,`出っ張り (H1比較)`,
            difficulty("通常","MKRSstar",1)+
            difficulty("全回収","none",0)
        ,`
            出っ張り追加　前作より少し難易度が上がりました。ただ、そこまで難しくありません。
        `,``
        ,`[東方] ほおずきみたいに赤い魂`)
    ),

    createGames("H3　★2" , gameURL("521714990","","")+gameDesMKRS(`265`,`ハンマー (H2比較)`,
            difficulty("通常","MKRSstar",2)+
            difficulty("全回収","none",0)
        ,`
            ハンマー追加　前回と難易度は変わらないか少し上がったくらい
        `,``
        ,`[ローリングスカイ] 空`)
    ),

    createGames("H4　★2" , gameURL("521726449","","")+gameDesMKRS(`275`,`スライド床 (H3比較)`,
            difficulty("通常","MKRSstar",2)+
            difficulty("全回収","none",0)
        ,`
            スライド床追加　難易度は前作とそんなに変わらない
        `,``
        ,`[東方] 靈異伝　10面テーマ　天使伝説`)
    ),
    
    createGames("H5　★4　longstage1" , gameURL("521763926","","")+gameDesMKRS(`600 (300×2)`,`タワー (H4比較)`,
            difficulty("通常","MKRSstar",4)+
            difficulty("全回収","none",0)
        ,`
            タワー追加　前作に比べだいぶ難しくなった。MKボールころころの元祖longstageである。<br>
            追記. IMSのレギュレーションだと多分★4は逆詐称ってくらいには簡単。というか近年のインフレがやばい。
        `,``
        ,`[東方] 無何有の郷`)
    ),

    createGames("H6　★2" , gameURL("522416302","","")+gameDesMKRS(`300`,`上がる床、下がる床 (H5比較)`,
            difficulty("通常","MKRSstar",2)+
            difficulty("全回収","none",0)
        ,`
            上がる床、下がる床追加　簡単めです、ただ、このタイルの追加により、初見殺しが厳しくなるかもしれません。<br>
            作者は一発クリアです。
        `,``
        ,`[東方] フラワリングナイト`)
    ),
    
    createGames("H7　★3" , gameURL("522428911","","")+gameDesMKRS(`320`,`ビーム、早めビーム、遅めビーム (H6比較)`,
            difficulty("通常","MKRSstar",3)+
            difficulty("全回収","none",0)
        ,`
            ビーム、早めビーム、遅めビーム追加　ちょい難しめ。<br>
            作者は一発クリアです
        `,``
        ,`[東方] ヴワル魔法図書館`)
    ),
    
    createGames("H8　★3" , gameURL("522441165","","")+gameDesMKRS(`320`,`上下バー (H7比較)`,
            difficulty("通常","MKRSstar",3)+
            difficulty("全回収","none",0)
        ,`
            上下バー追加　ちょっと難しめ。　何気に今回新開発のタイルもあります。やってみたらわかる。<br>
            作者は一発クリアです
        `,``
        ,`[東方] 人恋し神様`)
    ),
    
    createGames("H9　★4" , gameURL("522824939","","")+gameDesMKRS(`330`,`横移動四角 (H8比較)`,
            difficulty("通常","MKRSstar",4)+
            difficulty("全回収","none",0)
        ,`
            横移動四角追加　前作に比べ難易度が上昇しました。　最初に初見殺しも存在します。<br>
            作者は一発クリアです
        `,``
        ,`[ローリングスカイ] 砂漠`)
    ),

    createGames("H10　★5　longstage2" , gameURL("522848181","","")+gameDesMKRS(`700 (350×2)`,`ウェーブ床 (H9比較)`,
            difficulty("通常","MKRSstar",5)+
            difficulty("全回収","none",0)
        ,`
            ウェーブ床追加　かなり難しいです。最後は難所です。<br>
            これで
            <a href="https://scratch.mit.edu/users/s00384206/" target="_blank" rel="noopener noreferrer">
                @s00384206</a>
            さんの
            <a href="https://scratch.mit.edu/projects/158510115" target="_blank" rel="noopener noreferrer">
                新・ボールころころ5　Final</a>
            に出てくるギミックが全部出そろいました。この先はMKオリジナルのギミックが追加されていくのでお楽しみに。
            また、今作は2回目のロングステージです。100%地点にチェックポイントが配置されています。<br>
            作者は一発クリア!　頑張ってね。
        `,``
        ,`[東方] 月まで届け、不死の煙`)
    ),

    createGames("H11　★5" , gameURL("522975298","","")+gameDesMKRS(`300`,`隠しレーザー(通常、遅め、早め) (H10比較)`,
            difficulty("通常","MKRSstar",5)+
            difficulty("全回収","none",0)
        ,`
            隠しレーザー(通常、遅め、早め)追加　おそらくこれから難しくなります。<br>
            作者は一発クリア!　頑張ってね。
        `,``
        ,`[東方] ヴワル魔法図書館`)
    ),

    createGames("H12　★6" , gameURL("523080094","","")+gameDesMKRS(`330`,`高い出っ張り (H11比較)`,
            difficulty("通常","MKRSstar",6)+
            difficulty("全回収","none",)
        ,`
            高い出っ張り追加　初見殺しが多く、難しいです。
        `,``
        ,`[東方] 怪綺談 エキストラボスアリスのテーマ`)
    ),
    
    createGames("H13　★6" , gameURL("523633585","","")+gameDesMKRS(`340`,`ウェーブボール (H12比較)`,
            difficulty("通常","MKRSstar",6)+
            difficulty("全回収","none",)
        ,`
            ウェーブボール追加　だいぶ高度なテクニックが要求されるようになりました。あと今回タイルの縁の線を変えてみたので今までと雰囲気が違うはず。<br>
            作者は一発クリアです
        `,``
        ,`[東方] 靈異伝　魔界16~19面テーマ`)
    ),
     
    createGames("H14　★7" , gameURL("523731345","","")+gameDesMKRS(`350`,`ピッカリボール (H13比較)`,
            difficulty("通常","MKRSstar",7)+
            difficulty("全回収","none",)
        ,`
            ピッカリボール追加　だいぶ難しいです。　クリアは困難です。30%前後、55%前後が難所。激しい動きが多いです。<br>
            作者は一発クリアです。ちなみに次回は3回目のlongstageです。300%まで作る予定。
        `,``
        ,`[東方] 靈異伝　魔界16~19面テーマ`)
    ),
     
    createGames("H15　★8　longstage3" , gameURL("524009108","","")+gameDesMKRS(`1200 (400×3)`,`レーザータワーキューブ(普通、早め、遅め) (H14比較)`,
            difficulty("通常","MKRSstar",8)+
            difficulty("全回収","none",)
        ,`
            レーザータワーキューブ(普通、早め、遅め)追加　結構難しいです。クリアできたらすごいと思います。<br>
            また、今回は300%まであるので100%と200%地点にそれぞれチェックポイントがあります。そして案の定最後は難所です。(まあその他にも難所あるけど)<br>
            作者は10回くらいでクリアです(初めてノーミスを達成できなかったこの日である)
        `,``
        ,`[東方] 黒い海に紅く`)
    ),
     
    createGames("H16　★2" , gameURL("524084945","","")+gameDesMKRS(`315`,`上がるジャンプ床、下がるジャンプ床 (H15比較)`,
            difficulty("通常","MKRSstar",2)+
            difficulty("全回収","none",)
        ,`
            上がるジャンプ床、下がるジャンプ床追加　ここに来て一気に難易度が暴落します。まあ多分ここだけだと思います。<br>
            ちなみに一部のタイルは今回出番がありません。作者は一発クリアです。
        `,``
        ,`[東方] 怪綺談 エキストラボスアリスのテーマ`)
    ),
     
    createGames("H17　★6" , gameURL("524264816","","")+gameDesMKRS(`350`,`降ってくる棒 (H16比較)`,
            difficulty("通常","MKRSstar",6)+
            difficulty("全回収","none",)
        ,`
           降ってくる棒追加　棒の挙動の調整が大変でした。作者は二回でクリアです。
        `,``
        ,`[東方] 東方原曲　月時計〜ルナ・ダイアル〜`)
    ),
     
    createGames("H18　★6" , gameURL("524278569","","")+gameDesMKRS(`360`,`脆い床 (H17比較)`,
            difficulty("通常","MKRSstar",6)+
            difficulty("全回収","none",)
        ,`
            脆い床追加　最後は出番をずっともらえなかったピッカリボールが大量発生します。作者は一発クリアです。
        `,``
        ,`[東方] おてんば恋娘の冒険`)
    ),
     
    createGames("H19　★6" , gameURL("524314690","","")+gameDesMKRS(`360`,`大ジャンプ床、小ジャンプ床 (H18比較)`,
            difficulty("通常","MKRSstar",6)+
            difficulty("全回収","none",)
        ,`
            大ジャンプ床、小ジャンプ床追加　大ジャンプでは7マス、小ジャンプでは1マスジャンプします。<br>
            作者は一発クリアです。次作はlongstageです。長さはかなりあり、難所が多めです。
        `,``
        ,`[東方] 靈異伝　10面テーマ　天使伝説`)
    ),
     
    createGames("H20　★10　longstage4" , gameURL("524350242","","")+gameDesMKRS(`2000 (500×4)`,`スライドジャンプ床 (H19比較)`,
            difficulty("通常","MKRSstar",10)+
            difficulty("全回収","none",)
        ,`
            スライドジャンプ床追加　コースは長く、コースは適当。そして安定の高難易度<br>
            作者は18回くらいでクリアしたよ。MK歴代でもテクニックでは上位に入る難易度です。<br>
            追記. IMSの環境のレギュレーションで測ると、こいつは多分★10の中でも上位組に入る。判定狭いしクリア率はBE13よりも余裕で安定しない。

        `,``
        ,`[東方] 神々が恋した幻想郷`)
    ),
     
    createGames("H21　★8" , gameURL("524532390","","")+gameDesMKRS(`600`,`遅め、早め、通常速さにする床 (H20比較)`,
            difficulty("通常","MKRSstar",8)+
            difficulty("全回収","none",)
        ,`
            遅め、早め、通常速さにする床追加　遅めは下矢印、早めは上矢印、通常速さはひし形の形状をしているので覚えましょう。<br>
            longstageじゃない割には長さは600と長いです。<span class="lo">(多分これからコースの長さはこれくらいになります)</span><br>
            80%くらいにある遅めにする床以降が難所です。最後は加速の勢いでジャンプしてゴールです。作者は5回くらいでクリアしたよ。
        `,``
        ,`[ローリングスカイ] 深空`)
    ),
     
    createGames("H22　★6" , gameURL("524543757","","")+gameDesMKRS(`350`,`特殊ウェーブ(横一マス移動) (H21比較)`,
            difficulty("通常","MKRSstar",6)+
            difficulty("全回収","none",)
        ,`
            特殊ウェーブ(横一マス移動)追加　このウェーブとスライド床が重なるとスライドしなかったり2マススライドしたりします。<br>
            難易度は前回より低めですが、初見は苦しむかもしれません。作者は一発クリアしたよ。
        `,``
        ,`[東方] 東方原曲　夢時空　博麗_霊夢のテーマ`)
    ),
     
    createGames("H23　★7" , gameURL("524625152","","")+gameDesMKRS(`360`,`ジャンプ色の出っ張り (H22比較)`,
            difficulty("通常","MKRSstar",7)+
            difficulty("全回収","none",)
        ,`
            ジャンプ色の出っ張り追加　ウェーブと初見殺しやや多め<br>
            作者は5回でクリアしたよ
        `,``
        ,`[東方] 人恋し神様`)
    ),
     
    createGames("H24　★7" , gameURL("525033482","","")+gameDesMKRS(`360`,`ジャンプ色の高い出っ張り (H23比較)`,
            difficulty("通常","MKRSstar",7)+
            difficulty("全回収","none",)
        ,`
            ジャンプ色の高い出っ張り追加　通常の高い出っ張り同様、出っ張るまではどれが高い出っ張りか分からないので洞察力も試されるかもしれません。<br>
            作者は3回でクリアしたよ
        `,``
        ,`[東方] 東方原曲　恋色マスタースパーク`)
    ),
     
    createGames("H25　★10　longstage5" , gameURL("525144868","","")+gameDesMKRS(`1800 (600×3)`,`高い横移動四角 (H24比較)`,
            difficulty("通常","MKRSstar",10)+
            difficulty("全回収","none",)
        ,`
            横移動四角の高いバージョンです。もちろん上にいてもやられます。<br>
            ちなみに前回のlongstageに引き続き鬼畜コースです。意地悪ウェーブが多めです。<br>
            作者は5回でクリアしたよ
        `,``
        ,`[東方] 輝く針の小人族`)
    ),
     
    createGames("H26　★2" , gameURL("525692109","","")+gameDesMKRS(`340`,`バリア (H25比較)`,
            difficulty("通常","MKRSstar",2)+
            difficulty("全回収","none",)
        ,`
            バリア追加　1、2キーで有無を設定<br>
            バリアは障害物に当たったり落ちたりすると壊れ、しばらくボールを落下や衝突から守ります。この時間は、ボールの下にゲージが表示されます。<br>
            結構簡単めに作りました。出番薄いタイルあります。作者は一発クリアしたよ。
        `,``
        ,`[ローリングスカイ] 都市`)
    ),
     
    createGames("H27　★6" , gameURL("525748624","","")+gameDesMKRS(`360`,`スライド床に乗った出っ張り (H26比較)`,
            difficulty("通常","MKRSstar",6)+
            difficulty("全回収","none",)
        ,`
            スライド床に乗った出っ張り追加　高い出っ張りが多いところがあり、視界が悪いです。<br>
            作者は一発クリアしたよ。
        `,``
        ,`[東方] フラワリングナイト`)
    ),
     
    createGames("H28　★9" , gameURL("526513286","","")+gameDesMKRS(`500`,`カナアミ、上がるカナアミ、落ちるカナアミ (H27比較)`,
            difficulty("通常","MKRSstar",9)+
            difficulty("全回収","none",)
        ,`
            カナアミ、上がるカナアミ、落ちるカナアミ追加<br>
            結構難しいです。特に40%以降がね。作者は2回でクリアしたよ。
        `,``
        ,`[東方] 厄神様の通り道`)
    ),
     
    createGames("H29　★9" , gameURL("527215042","","")+gameDesMKRS(`480`,`勝手に3回ジャンプ床 (H28比較)`,
            difficulty("通常","MKRSstar",9)+
            difficulty("全回収","none",)
        ,`
            勝手に3回ジャンプ床追加　初見殺し的に難易度高いです。確実に初心者を殺しにかかってきます。<br>
            作者は6回でクリアしたよ。
        `,``
        ,`[東方] 香る樹葉花`)
    ),
     
    createGames("H30　★10　longstage6" , gameURL("527511133","","")+gameDesMKRS(`1800 (600×3)`,`ジャンパー力 (H29比較)`,
            difficulty("通常","MKRSstar",10)+
            difficulty("全回収","none",)
        ,`
            ジャンパー力追加<br>
            白いひし形に触れるとジャンパー力が一つ宿ります。前方が穴または障害物の時、ジャンパー力を一つ消費してジャンプします。<span class="lo">(勝手にジャンプするので注意)</span><br>
            テクニック、初見殺しともに難易度が高いかつ長いです。作者以外でクリアできたら超人です。作者は約20回でクリアしたよ
        `,``
        ,`[東方] 幻想浄瑠璃`)
    ),
     
    createGames("H31　★7" , gameURL("528725188","","")+gameDesMKRS(`525`,`スティックハンマー (H30比較)`,
            difficulty("通常","MKRSstar",7)+
            difficulty("全回収","none",)
        ,`
            スティックハンマー追加<br>
            また、記念すべき30作突破として、出っ張りの色は青色、遅めレーザーの光線の色は白色、早めレーザーの光線の色は黒色、通常のハンマーの色は黒色に変わりました。<br>
            なかなかな難易度です。手順を間違えると攻略がキツくなるところも...   作者は2回でクリアしたよ<br>
            タイルの出現の偏りがすごいことになっています。ウェーブボール、降ってくる棒、スピード変更床、スライドジャンプ床は出てきません。(まあ仕方ない)
        `,``
        ,`[東方] ほおずきみたいに紅い魂`)
    ),

    createGames("H32　★8" , gameURL("528824654","","")+gameDesMKRS(`550`,`即席ゲート (H31比較)`,
            difficulty("通常","MKRSstar",8)+
            difficulty("全回収","none",)
        ,`
            即席ゲート追加<br>
            カナアミの色はタイルの淵線に合わせているので今回は金網の色が綺麗だと思います。<br>
            あと脆いタイルの色が背景のせいで鬼畜です。そして通常ステージにも関わらず難関です。特に最後がわかりづらく難しいです<br>
            作者は7回でクリアしたよ　前作に出てこなかったタイルは今回出してみました。<span class="lo">(まだ見落としがあるかも...)</span>
        `,``
        ,`[東方] ルーネイトエルフ`)
    ),
    createGames("H33　★8" , gameURL("529419034","","")+gameDesMKRS(`575`,`出っ張りゲート (H32比較)`,
            difficulty("通常","MKRSstar",8)+
            difficulty("全回収","none",)
        ,`
            出っ張りゲート追加　出っ張りの一種ですが当たり判定は一切ありません。<br>
            初見殺しの面で難しいです　あと今回はタイル色の関係でジャンパー力の出番はなしです。<br>
            作者は2回でクリアしたよ
        `,``
        ,`[東方] 上海紅茶館`)
    ),
    createGames("H34　★10" , gameURL("530560638","","")+gameDesMKRS(`1200`,`降ってくる短い棒 (H33比較)`,
            difficulty("通常","MKRSstar",10)+
            difficulty("全回収","none",)
        ,`
            降ってくる短い棒追加　100%あたりの長さはMK史上一番長いです。<span class="lo">共有された当時はね...</span><br>
            今回も初見殺しの面で難しいです　また、ステージは長くかつチェックポイントがないため、クリアは難しいです。<br>
            あと脆い床と普通の床の区別が難しいです。作者は30回程度でクリア<br>
        `,``
        ,`[東方] U.N.オーエンは彼女なのか？`)
    ),
    createGames("H35　★10　longstage7" , gameURL("531116905","","")+gameDesMKRS(`3500 (700×5)`,`スイッチと実体化するタイル (H34比較)`,
            difficulty("通常","MKRSstar",10)+
            difficulty("全回収","none",)
        ,`
            スイッチと実体化するタイル追加<br>
            今回は難易度が半端ないです。特にテクニックが。さらにステージも最長です。<span class="lo">(700x5=3500　タイル数に変換して17500)</span><br>
            500%まである チェックポイント4つあり。これを作者以外でクリアできたらこの世の人ではありません。<br>
            <br>
            また、このステージにはいくつか特徴があります。<br>
            ・100~137%くらいの範囲には障害物がありません<br>
            ・200~300%までの床は全てウェーブしています<span class="lo">(多分ここが絶望的に難しいです)</span><br>
            ・400%以降では時々ステージに文字があります。1234567890FULLRUN!と、FINALSTAGE!があります<br>
            <br>
            作者はついにクリア! <span class="lo">(2025/04/24)　※実に公開から3年近くたっての初クリア</span><br>
            この作品でMKボールころころ本編は終わりです。これから番外編も作ります。<br>
            <br>
            2026/06/23追記<br>
            このステージこそ、MKボールころころの旧ラスボスと呼ばれていたステージである。ひたすらに長く、それなりに足場が狭く、何より極悪非道といえるような200~300%地帯があるため。
            でも、インフレって恐ろしいもので、近年はこれより難しいステージも出てきている。BA3やBA6とかね。お前だお前。
        `,``
        ,`[東方] ネイティブフェイス`)
    ),
    
];



const li_MKBC_B=[
    createGames("B1　★3" , gameURL("535095945","","")+gameDesMKRS(`320`,`ジャンプ床、出っ張り、ハンマー、スライド床、タワー、上がる床、下がる床、上下バー、横移動四角、レーザー3種、ウェーブ床、バリア、星`,
            difficulty("通常","MKRSstar",3)+
            difficulty("全回収","MKRSstar",4)
        ,`
            ついにボーナスころころ登場!<br>
            ジャンプ床、出っ張り、ハンマー、スライド床、タワー、上がる床、下がる床、上下バー、横移動四角、レーザー3種、ウェーブ床、バリア、星追加<br>
             ボーナスころころの1作目です　星は全部で9個<br>
            作者はソロで一発クリアだよ　5回で星全部取ったよ<br>
            星の数や最大数や、どこで取り逃したかわかるようになりました。7つ目がややこしいところにあります。
        `,``
        ,`[東方] ヴワル魔法図書館`)
    ),

    createGames("B2　★5" , gameURL("535118927","","")+gameDesMKRS(`400`,`高い出っ張り、ウェーブボール、ピッカリボール、隠しレーザー、レーザービームキューブ、ジャンプ床に乗った星 (B1比較)`,
            difficulty("通常","MKRSstar",5)+
            difficulty("全回収","MKRSstar",7)
        ,`
            高い出っ張り、ウェーブボール、ピッカリボール、隠しレーザー、レーザービームキューブ、ジャンプ床に乗った星追加<br>
            ボーナスころころの2作目です　難易度の上昇がやばいです　星は全部で9個<br>
            作者は一発クリアだよ(星も全部取ったよ)<br>
            いくつかの星はややこしいところにあります。ほとんどの星がテクニックが必要なところにあります
        `,``
        ,`[東方] 平安のエイリアン`)
    ),

    createGames("B3　★6" , gameURL("535527130","","")+gameDesMKRS(`500`,`上がるジャンプ床、下がるジャンプ床、降ってく棒、大ジャンプ床、小ジャンプ床、スライドジャンプ床、金の星 (B2比較)`,
            difficulty("通常","MKRSstar",6)+
            difficulty("全回収","MKRSstar",9)
        ,`
            上がるジャンプ床、下がるジャンプ床、降ってく棒、大ジャンプ床、小ジャンプ床、スライドジャンプ床、金の星追加<br>
            ボーナスころころの3作目です。　星は全部で11個　全部取ってのクリアは鬼畜です。<br>
            初見殺しが厳しいです。　難易度は緩和はしましたがそれでもむずいです　。ほとんどの星がテクニックが必要なところにあります。<br>
            作者はソロで3回くらいでクリアしたよ。　10回くらいで作者は星を全部取れました。
        `,``
        ,`[東方] 無何有の郷`)
    ),

    createGames("B4　★7" , gameURL("535975953","","")+gameDesMKRS(`500`,`スピード変更床、特殊ウェーブ、ジャンプ色の出っ張り、ジャンプ色の高い出っ張り、高い横移動四角 (B3比較)`,
            difficulty("通常","MKRSstar",7)+
            difficulty("全回収","MKRSstar",10)
        ,`
            スピード変更床、特殊ウェーブ、ジャンプ色の出っ張り、ジャンプ色の高い出っ張り、高い横移動四角追加<br>
            あ、いつの間にかスピード変更床が独自の色を持つようになりました。<lo>(速くするのは青、遅くするのは赤、普通にするのは灰色)</lo><br>
            星は全部で11個　全部取ってのクリアは鬼畜です。　本編作品よりタイル管理が下手になりました。<br>
            作者はソロで3回くらいでクリアしたよ。(星は10個)
        `,``
        ,`[東方] フラワリングナイト`)
    ),

    createGames("B5　★9　longstage8" , gameURL("","","")+gameDesMKRS(`--`,`--`,
            difficulty("通常","MKRSstar",)+
            difficulty("全回収","none",)
        ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
        `,``
        ,`--`)
    ),

    createGames("B6　★6" , gameURL("","","")+gameDesMKRS(`--`,`--`,
            difficulty("通常","MKRSstar",)+
            difficulty("全回収","none",)
        ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
        `,``
        ,`--`)
    ),

    createGames("B7　★5" , gameURL("","","")+gameDesMKRS(`--`,`--`,
            difficulty("通常","MKRSstar",)+
            difficulty("全回収","none",)
        ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
        `,``
        ,`--`)
    ),

    createGames("B8　★10" , gameURL("","","")+gameDesMKRS(`--`,`--`,
            difficulty("通常","MKRSstar",)+
            difficulty("全回収","none",)
        ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
        `,``
        ,`--`)
    ),

    createGames("B9　★7" , gameURL("","","")+gameDesMKRS(`--`,`--`,
            difficulty("通常","MKRSstar",)+
            difficulty("全回収","none",)
        ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
        `,``
        ,`--`)
    ),

    createGames("B10　★10　longstage9" , gameURL("538473496","","")+gameDesMKRS(`1800 (900×2)`,`ウェーブタワー (B9比較)`,
            difficulty("通常","MKRSstar",10)+
            difficulty("全回収","MKRSstar",10)
        ,`
            ウェーブタワー追加<br>
            あ、そうそう、今作は進んでいくと背景やらタイルやらが徐々に明るくなります。この変化好きです。<br>
            星は全部で20個　MKボーナスころころ史上一番難しいです　MKころころシリーズ歴代でも上位の難易度です。作者はソロでなんとかクリア(めっちゃ疲れた)<br>
            と言うかソロでクリアできただけでもすごいです。(この難易度は星を集めるどころじゃない)
        `,``
        ,`[東方] 夜が降りてくる ～ Evening Star(前半のみ)`)
    ),
];



const li_MKBC_O=[
    createGames("O1　★8" , gameURL("540918991","","")+gameDesMKRS(`550`,`なし (B10比較)`,
            difficulty("通常","MKRSstar",8)+
            difficulty("全回収","none",)
        ,`
            60%付近が難所　作者は10回くらいでクリアだよ<br>
            2026/06/07追記 : せっかくの新シリーズなのに、説明欄がこれでもかというほどシンプルである。書いてて逆に驚いた。<br>
        `,``
        ,`[東方] 黒い海に紅く`)
    ),

    createGames("O2　★9" , gameURL("540996653","","")+gameDesMKRS(`600`,`なし (O1比較)`,
            difficulty("通常","MKRSstar",9)+
            difficulty("全回収","none",)
        ,`
            テクニック難易度やや高め　作者は3回でクリア<br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            はっ!<br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            はっ!<br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            フぁ!<br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            ファンクション! (くしゃみ)
        `,``
        ,`[東方] ハルトマンの妖怪少女`)
    ),

    createGames("O3　★7" , gameURL("541607259","","")+gameDesMKRS(`100`,`なし (O2比較)`,
            difficulty("通常","MKRSstar",7)+
            difficulty("全回収","none",)
        ,`
            ※序盤のところに救済措置あり<br>
            MK史上一番短いがなかなかむずい<lo>(最近最短記録がBA1に抜かれたって話しする?)</lo><br>
            作者は3回でクリア<br>
        `,``
        ,`[ローリングスカイ] カンフー`)
    ),

    createGames("O4　★10" , gameURL("543249144","","")+gameDesMKRS(`1000`,`なし (O3比較)`,
            difficulty("通常","MKRSstar",10)+
            difficulty("全回収","none",)
        ,`
            今回は長め　足場悪いとこ多め　難易度容赦なし<br>
            なんと作者は未クリア!　(90%)　<lo>(あの後どこかの誰かさんの要望で、2024年か2025年に初クリアを果たした。遅いよクリアチェックが!)</lo><br>
            <br>
            (ガガガ...　オモイ...　プシューー...) <br>
            (その後フリーズした)<br>
        `,``
        ,`[東方] 亡き王女の為のセプテット`)
    ),

    createGames("O5　★10　longstage10" , gameURL("543867260","","")+gameDesMKRS(`1600 (800×2)`,`なし (O4比較)`,
            difficulty("通常","MKRSstar",10)+
            difficulty("全回収","none",)
        ,`
            ＊記念すべき10個目のlongstage　つまりMKぼるころはここで50作品目ってことだ。<br>
            今回は複雑です。加えて膨大な難易度と初見殺しがてんこ盛りです。クリアできたら神です。<br>
            <br>
            作者はクリア! (超疲れた)　60%あたりから難所<br>
            <br>
            <br>
            ※このコースには3箇所の不備があったため、修正しました。<br>
            TASを使うところが1つもないところが唯一の救いなのかもしれない...<br>
            <lo>(あ、そもそも判定緩くないんだった。)</lo>
        `,``
        ,`[東方] 魔法少女達の百年祭`)
    ),

    createGames("O6　★7" , gameURL("544206831","","")+gameDesMKRS(`1200`,`なし (O5比較)`,
            difficulty("通常","MKRSstar",7)+
            difficulty("全回収","none",)
        ,`
            単純な地形が多く、非常に長いです。忍耐と洞察力との勝負です。<br>
            強いていうなら最後のジャンプ床ゾーンが少し難しいです。作者は一発クリアだよ<br>
            <br>
            あ、そうそう　レーザーがしれっとイメチェンしてます。
        `,``
        ,`[ローリングスカイ] テトリス`)
    ),

    createGames("O7　★6" , gameURL("544526907","","")+gameDesMKRS(`400`,`ガードレール (O6比較)`,
            difficulty("通常","MKRSstar",6)+
            difficulty("全回収","none",)
        ,`
            ガードレール追加<br>
            ガードレールとボールは正面からの衝突を防ぎます。<br>
            ただ、障害物扱いなので横から入るとボールは壊れます。<br>
            <br>
            コース自体は短いですが、ガードレールで足止めされるので、少し長く感じるかも。<br>
            作者は一発クリアだよ。
        `,``
        ,`[ローリングスカイ] ハロウィン`)
    ),

    createGames("O8　★7" , gameURL("230067994","","")+gameDesMKRS(`2000`,`特殊形式のステージ (O7比較)`,
            difficulty("通常","MKRSstar",7)+
            difficulty("全回収","none",)
        ,`
            今回のステージは、少し特殊です。<br>
            即席ゲートをくぐることによって、チェックポイントを確保できます。さらにバリアを獲得できます。また、指定回数即席ゲートをくぐればゴールです。<br>
            <br>
            ゲートポイントは15個　つまり15箇所セーブポイントがあります。ゲートポイントのステージはそれぞれ特徴が違います。<br>
            星の数は作者の推定難易度<br>
            <br>
            G0~G1　★★★★<br>
            いろいろ混じってる　短い<br>
            G1~G2　★★★<br>
            出っ張り系多い<br>
            G2~G3　★★★<br>
            ハンマー系多い<br>
            G3~G4　★★★★<br>
            スライド床系が多い<br>
            G4~G5　★★★★<br>
            上がる床、下がる床が多い<br>
            G5~G6　★★★★★<br>
            横移動四角、ピッカリボール、ウェーブボールがメイン<br>
            G6~G7　★★★★★<br>
            上下バー、レーザービームがメイン<br>
            G7~G8　★★★★★★★★<br>
            タワーがメイン、他と比べて難易度高め、短い<br>
            G8~G9　★★★★★<br>
            ガードレールがメイン、サブは3回床とジャンパー力。<br>
            G9~G10　★★★★<br>
            透明の障害物が多い。区画が短いし、難易度も高くない<br>
            G10~G11　★★★★★★★<br>
            初見殺しが少し多めの美しい区画<br>
            G11~G12　★★★★★★★<br>
            美しいウェーブの景色がいい。ただ視覚的に難しい。<br>
            G12~G13　★★★★<br>
            ナゾネジがメインの区画<br>
            G13~G14　★★★★★★<br>
            初めから最後まで3回ジャンプ床が大量<br>
            G14~G15　★★★★★<br>
            カウントダウンの後に、I WILL GO THERE SOONと書かれていて、その後ゴール　<lo>(GOとTHEREの間にTOがありますが、作者のミスですので気にしないでください)</lo><br>
            <br>
            <br>
            作者は4回でクリア
        `,``
        ,`[ローリングスカイ] 電子迷宮`)
    ),

    createGames("O9　★10" , gameURL("546135119","","")+gameDesMKRS(`650`,`なし (O8比較)`,
            difficulty("通常","MKRSstar",10)+
            difficulty("全回収","none",)
        ,`
            超絶難しいです　最後まで気が抜けません　久しぶりにふざけ要素のないステージ<br>
            作者は8回くらいでクリア　最後のジャンプ床ウェーブゾーンは難所。<br>
            ちなみに、IMSのレギュレーションから見るとこのステージは少し逆詐称なのでご安心を。ゆうてそんなにむずくはない。多分★9くらい。
            技術難と認識難どっちも程よく併せ持つバランスタイプなコース。あと背景が2段階グラデーションしているという、非常に珍しいステージでもある。
        `,``
        ,`[東方] 運命のダークサイド`)
    ),

    createGames("O10　★10　longstage11" , gameURL("548176289","","")+gameDesMKRS(`1800 (900×2)`,`多重バリア (O9比較)`,
            difficulty("通常","MKRSstar",10)+
            difficulty("全回収","none",)
        ,`
            多重バリア追加。スタート時に数字キーでバリアの数を0~9まで調節可能<br>
            ※非常に重いです!<br>
            <br>
            超鬼畜です　クリアできたらヤバすぎます<br>
            ※テクニック難易度最高の自信あり<lo>(推定、1位 おまけ10、2位 本編20、3位 おまけ5)</lo><br>
            <br>
            2026/07/12追記 :<br>
            流石に昨今のインフレでBA3やBA6とかのヤバいステージが出てきたけど、それでも要求技術は★10の中でも依然として高く、難易度は★10最上位といっても過言ではない。あとこのステージで追加された多重バリアはマジで神機能。攻略が格段にしやすくなった。
            <br>
            <br>
            作者はクリア (9重バリア、チェックポイントあり)<br>
            <lo>(だってバリア少ないとほぼ無理ゲーだからね...)</lo><br>
            <br>
            ちなみに一重バリアで作者は162%
        `,``
        ,`[東方] 神々が恋した幻想郷`)
    ),

    createGames("O11　★10" , gameURL("","","")+gameDesMKRS(`--`,`--`,
            difficulty("通常","MKRSstar",)+
            difficulty("全回収","none",)
        ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
        `,``
        ,`--`)
    ),

    createGames("O12　★8" , gameURL("","","")+gameDesMKRS(`--`,`--`,
            difficulty("通常","MKRSstar",)+
            difficulty("全回収","none",)
        ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
        `,``
        ,`--`)
    ),

    createGames("O13　★7" , gameURL("","","")+gameDesMKRS(`--`,`--`,
            difficulty("通常","MKRSstar",)+
            difficulty("全回収","none",)
        ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
        `,``
        ,`--`)
    ),

    createGames("O14　★10" , gameURL("","","")+gameDesMKRS(`--`,`--`,
            difficulty("通常","MKRSstar",)+
            difficulty("全回収","none",)
        ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
        `,``
        ,`--`)
    ),

    createGames("O15　★10　longstage12" , gameURL("","","")+gameDesMKRS(`--`,`--`,
            difficulty("通常","MKRSstar",)+
            difficulty("全回収","none",)
        ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
        `,``
        ,`--`)
    ),

    createGames("O16　★10" , gameURL("","","")+gameDesMKRS(`--`,`--`,
            difficulty("通常","MKRSstar",)+
            difficulty("全回収","none",)
        ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
        `,``
        ,`--`)
    ),

    createGames("O17　★6" , gameURL("","","")+gameDesMKRS(`--`,`--`,
            difficulty("通常","MKRSstar",)+
            difficulty("全回収","none",)
        ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
        `,``
        ,`--`)
    ),

    createGames("O18　★9" , gameURL("550489719","","")+gameDesMKRS(`700`,`視覚状態変化 (O17比較)`,
            difficulty("通常","MKRSstar",9)+
            difficulty("全回収","none",)
        ,`
            視覚状態変化追加　緑の菱形が視野を広くし、青の菱形は視野を狭くします。また、赤いばつ印は視覚状態変化を消します。<br>
            出っ張り類に光沢を追加　これによりジャンプ床とジャンプ色の出っ張りを光沢の有無で見分けられるように。<br>
            作者は6回でクリア(地味に苦戦した)
        `,``
        ,`[ローリングスカイ] 遺跡`)
    ),

    createGames("O19　★9" , gameURL("","","")+gameDesMKRS(`--`,`--`,
            difficulty("通常","MKRSstar",)+
            difficulty("全回収","none",)
        ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
        `,``
        ,`--`)
    ),

    createGames("O20　★10　longstage13" , gameURL("","","")+gameDesMKRS(`--`,`--`,
            difficulty("通常","MKRSstar",)+
            difficulty("全回収","none",)
        ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
        `,``
        ,`--`)
    ),

    createGames("O21　★10" , gameURL("","","")+gameDesMKRS(`--`,`--`,
            difficulty("通常","MKRSstar",)+
            difficulty("全回収","none",)
        ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
        `,``
        ,`--`)
    ),

    createGames("O22　★4" , gameURL("","","")+gameDesMKRS(`--`,`--`,
            difficulty("通常","MKRSstar",)+
            difficulty("全回収","none",)
        ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
        `,``
        ,`--`)
    ),

    createGames("O23　★10" , gameURL("","","")+gameDesMKRS(`--`,`--`,
            difficulty("通常","MKRSstar",)+
            difficulty("全回収","none",)
        ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
        `,``
        ,`--`)
    ),

    createGames("O24　★6" , gameURL("","","")+gameDesMKRS(`--`,`--`,
            difficulty("通常","MKRSstar",)+
            difficulty("全回収","none",)
        ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
        `,``
        ,`--`)
    ),

    createGames("O25　???????????　longstage14" , gameURL("555520773","","")+gameDesMKRS(`3000 (1000×3)`,`なし`,
            difficulty("通常","","??????????")+
            difficulty("全回収","none",)
        ,`
            何もかにもが...　黒い世界へ...　ようこそ...<br>
            <br>
            縺薙ｌ縺ｧMK縺翫∪縺代％繧阪％繧阪?邨ゅｏ繧翫→縺ｪ繧翫∪縺?..<br>
            髟ｷ繧峨￥驕翫ｓ縺ｧ縺?◆縺?縺阪≠繧翫′縺ｨ縺?＃縺悶＞縺ｾ縺励◆...<br>
            縺代←縺薙ｌ縺ｧ繧ｷ繝ｪ繝ｼ繧ｺ縺ｯ邨ゅｏ繧翫∪縺帙ｓ...<br>
            縺薙?蠕後↓逡･遘ｰ縲君縲阪?縲梧眠MK繝懊?繝ｫ縺薙ｍ縺薙ｍ縲阪′邯壹″縺ｾ縺?..縲?縺ｧ縺ｯ...縲?縺ｯ縺ｯ縺ｯ縺ｯ??..<br>
            <br>
            ・－－・　－・－・・　・・　　－・・－・　・・－　・－・　・－　－－　<br>
            <br>
            zzz...
        `,``
        ,`[ローリングスカイ] 丘 <br> [東方] 輝く針の小人族`)
    ),
];



const li_MKBC_N=[
    createGames("N1　★1" , gameURL("560669730","","")+gameDesMKRS(`260`,`床、ジャンプ床、出っ張り、レーザー、脆い床、ウェーブ床、バリア`, difficulty("通常","MKRSstar",1)+ difficulty("全回収","none",) ,`
        床、ジャンプ床、出っ張り、レーザー、脆い床、ウェーブ床、バリア追加<br>
        <br>
    新作ボールころころです。おまけとはまた別。今回はかなり簡単にした。また、脆い床のデザインを透明ガラスに近づけました。
    さらに、前作でブロック数が9000を超えて重かったのを、2000個以上減らし、現在の描画プログラムのブロック数は7000未満になりました。
    その他、新作になって様々な仕様変更があります。作者は余裕で一発クリア
    `,``,`[東方] 亡き王女の為のセプテット`)),

    createGames("N2　★2" , gameURL("560922785","","")+gameDesMKRS(`300`,`ハンマー、スライド床、タワー、上がる床下がる床、上下バー、高い出っ張り (N1比較)`, difficulty("通常","MKRSstar",2)+ difficulty("全回収","none",) ,`
        ハンマー、スライド床、タワー、上がる床下がる床、上下バー、高い出っ張り追加<br>
        上下バーの初見殺しに気を付ければ簡単にクリアできると思います。作者は一発クリア<br>
    `,``,`[東方]千年幻想郷`)),

    createGames("N3　★3" , gameURL("560982040","","")+gameDesMKRS(`400`,`レーザー、隠しレーザー全種、上がるジャンプ床落ちるジャンプ床、ウェーブボール、ピッカリボール (N2比較)`, difficulty("通常","MKRSstar",3)+ difficulty("全回収","none",) ,`
        レーザー、隠しレーザー全種、上がるジャンプ床落ちるジャンプ床、ウェーブボール、ピッカリボール追加<br>
        作者は一発クリア
    `,``,`[東方] 靈異伝　魔界16～19面テーマ`)),

    createGames("N4　★5" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("N5　★8　longstage15" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),


    createGames("N6　★8" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("N7　★10" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("N8　★9" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("N9　★10" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("N10　★10　longstage16" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),


    createGames("N11　★6" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("N12　★9" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("N14　★9" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("N15　★10　longstage17" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    
    createGames("N16　★10" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("N17　★8" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("N18　★10" , gameURL("566596605","","")+gameDesMKRS(`730`,`速いステージ (N17比較)`, difficulty("通常","MKRSstar",10)+ difficulty("全回収","none",) ,`
            速いステージ追加　前作の1.5倍くらい速いです。<br>
            通常の速さが違うMKボールころころは史上初です。相変わらずジャンプのプログラムがややこしい。<br>
            前作とは打って変わって、鬼畜ステージです。また、視覚状態変化による視野の上下に伴い背景の明るさも変わるようになりました。<br>
            作者は15回くらいでクリア
    `,``,`[東方] 妖魔夜行`)),

    createGames("N19　★9" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("N20　★6　longstage18" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),


    createGames("N21　★8" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("N22　★8" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("N23　★7" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("N24　★8" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("N25　★10　longstage19" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),


    createGames("N26　★2" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("N27　★9" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("N28　★9" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("N29　★5" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("N30　★10　longstage20" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),


    createGames("N31　★5" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("N32　★8" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("N33　★10" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("N34　★10" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("N35　★10　longstage21" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    
    createGames("N36　★9" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("N37　★9" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("N38　★8" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("N39　★9" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("N40　★7" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),
];



const li_MKBC_BE=[
    createGames("BE1　★1" , gameURL("723401832","","")+gameDesMKRS(`297`,`なし (N40比較)`, difficulty("通常","MKRSstar",1)+ difficulty("全回収","none",) ,`
            初めて作ってみました。曲に合わせて進むころころ<br>
            今回は簡単です。<br>
            N40で終わるつもりでしたが
            <a href="https://scratch.mit.edu/users/kumafuji1202/" target="_blank" rel="noopener noreferrer">
                @kumafuji1202</a>
            さんの曲に合わせたボールころころに感動して作ってみました。略称はBE　最大20まで続くつもり
    `,``,`[東方] ほおずきみたいに紅い魂`)),

    createGames("BE2　★4" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("BE3　★8" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("BE4　★9" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("BE5　★10" , gameURL("","","")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    
    createGames("BE6　★9" , gameURL("733173050","","")+gameDesMKRS(`1794`,`視覚状態変化　黄色、水色、ピンク色 (BE5比較)`, difficulty("通常","MKRSstar",9)+ difficulty("全回収","none",) ,`
        視覚状態変化　黄色、水色、ピンク色追加<br>
        今回は結構速いよ。流石に今回はむずすぎました。　次回の次回は簡単にします。(つまり次回もむずいです。)<br>
        個人的にテーマもいいし音ハメも良いし爽快感抜群でちょうどいい難易度だしで神譜面評価なステージ。一度やってみてくれー!<br>
        <br>
        【主にアクセス帳から来た方へ】<br>
        60fpsモードは解除してプレイしてください。60fpsが有効なままだとジェットパックゾーンを正常に通過できません。ご協力よろしくお願いします。<br>
    `,``,`[東方] 黒い海に紅く`)),

    createGames("BE7　★10" , gameURL("741731865","","")+gameDesMKRS(`1270`,`なし (BE6比較)`, difficulty("通常","MKRSstar",10)+ difficulty("全回収","none",) ,`
        今回は結構足場が狭いよ。次回は通常のスピードにするから待っててね。ちなみに1重バリア以下でクリアできたらもうそれは神に等しいと思うよ。<br>
        (オーバー表現だけどそれくらい速くて難しいです。)<br>
        視覚状態変化とキー操作が厄介なステージ...とよくコメントで言われます...<br>
        ちなみにN13の雨が復活しています。この雨演出、BE9の紙吹雪にも応用されたしBA8で再び登場したりで割と重要なやつ。
    `,``,`[東方] 有頂天変`)),

    createGames("BE8　★6" , gameURL("743246651","","")+gameDesMKRS(`950`,`なし (BE7比較)`, difficulty("通常","MKRSstar",6)+ difficulty("全回収","none",) ,`
            通常の速さかはわかりませんが、パターンを読みやすいようには作りました。前回と比べるとかなり簡単です。<br>
            簡単ゆえBEシリーズでは挑戦者が多く、Scratchでの参照数はなんと7000を超えた。ちなみに原因は忘れたがいろんな人にたくさんリミックスされる時期があった。<br>
            この後のBE9、このステージの面影ないほどに変わりすぎなんだよな...マジで比較してみてほしい。Scratchの説明欄の方にはBE9のリンクもあるので。
    `,``,`[ローリングスカイ] 森`)),

    createGames("BE9　★9" , `原作<br>`+gameURL("235811811","IMS","","ScDeprecated")+`copy version<br>`+gameURL("497722837","IMS","","ScDeprecated")+gameDesMKRS(`1758`,`高いハンマー、高いスティックハンマー、レーザーハンマー、レーザータワー、Party Poppers (BE8比較)`, difficulty("通常","MKRSstar",9)+ difficulty("全回収","none",) ,`
        あのMKころころが、あらゆるシステム面でパワーアップして「Improved MK System」として復活!　皆さん、長らくお待たせしました!<br>
        主に、以下の点が修正、改善されています。<br>
        <br>
        ・ボールなどのアニメーション<br>
        ・3D描画(特にボール後ろの描画)<br>
        ・床と立体の独立<br>
        ・当たり判定(レーザーなど大々的に変更されている)<br>
        ・タブレット勢でも公平に遊べる設計<br>
        ・細かな設定ができるコーナーの追加<br>
        ・よりスピーディーになった操作性<br>
        ・実績の追加　君は何枚メダルを集められるかな?<br>
        <br>
        今回は、このImproved MKシステムの第1作にしてビートころころの第9作目となります。この新システムでいろんな過去作リメイクしたい...<br>
        <br>
        <br>
        高いハンマー、高いスティックハンマー、レーザーハンマー、レーザータワー、Party Poppers 追加 (なんといきなり10種も立体が追加された!)<br>
        いろんなところを凝って作ってみました。でも所見殺し少なめに作っています。...と言いたかった... ちなみに落下床の出番は66%～68%だけにしかないよ。<br>
        作者はデフォルト設定でクリア。(というかデバグの過程で何回クリアしたんだろうか...)<br>
        <br>
        Improved MK Systemで新しくできること<br>
        ・模範リプレイの視聴<br>
        ・自分のリプレイの視聴<br>
        ・倍速の設定<br>
        ・当たり判定の緩さの設定<br>
        ・バリアの個数の設定(9→99に拡張!)<br>
        ・初見殺しの程度の設定<br>
        ・練習モードでプレイ(何回ダメージ受けてもOK!)<br>
        ・中断(qキー or 画面上部タップ)<br>
        ・%、最高記録、被ダメージなどの表示/非表示<br>
        ・BGMを消す　・効果音を消す<br>
        ・実績の閲覧<br>
        ・統計の閲覧<br>
        ・エディタでリプレイを編集する<br>
        ndnd...
    `,``,`<a href="https://www.youtube.com/watch?v=19y8YTbvri8" target="_blank" rel="noopener noreferrer">
            [サツキ] メズマライザー / 初音ミク・重音テトSV</a>`)),
            
    createGames("BE9.1　★8" , `原作<br>`+gameURL("88207130","IMS","","ScDeprecated")+`copy version<br>`+gameURL("322855503","IMS","","ScDeprecated")+gameDesMKRS(`1146`,`上がったままのタワー、下がるタワー、下がったままのタワー、前に伸びるタワー、後ろに伸びるタワー (BA6.1比較)`, difficulty("通常","MKRSstar",8)+ difficulty("全回収","MKRSstar",9) ,`
        上がったままのタワー、下がるタワー、下がったままのタワー、前に伸びるタワー、後ろに伸びるタワー追加<br>
        <br>
        作者がBE13を意地でも作りたくないがために、このサブレベルを作ったそうです。理由がギミックを作りたくないためらしいですが...それで新ギミックを作ってしまっては本末転倒では...?<br>
        ちなみにBE9と直接的なつながりはなくて、BE9→BE10→BA1→BA2→BE11→BE12→BE12.1→BA3→BA4→BA5→BA6→BA6.1→BA7→BE9.1という開発順でつながっていて、追加ギミックの所にはBA7にはなかったものを書いてるよ。
        そしてなんと!　今回は★8にしてはゲキムズかも...?(聞いてくれ、これ★3～4にするつもりだったんよ。なんかムズくなった。)<br>
        簡単なところと難しい所の差が激しいです。　といっても技術難は局所的で、難しい要因は8割が視認難でしょう。特にサビはえげつない。また今回はコースを手抜きにしました。時間がなかったというのもあるけど、表現の一環という意味合いが強いです。また出てくるギミックも割と限定されます。今回、出っ張りやハンマーやタワーの出番はほとんどがマイナーギミックに乗っ取られたそうです。下剋上!<br>
        <br>
        あ、今回はめっちゃ速いゾーンどこにもないからね。(最大BPM154)　BE9のBPMは185で、少し遅くなったのになぜかBE9より難しく感じる...　それにしても、長さ1146はBE9から減りすぎじゃないか...?<br>
        もうね、なんでこんなステージ構成にしたんだろう。おかげで模範リプレイは何とか作れたけどだるかった。もう二度と御免だ。プレイする側も、自分で自分の首を絞めることがないように...気をつけましょう...<br>
        <br>
        BE13は東方曲でコース作るぞー!<br>
        <br>
        <br>
        ===小ネタ===<br>
        実は、MKの作品の中でURL番号が一番低い作品がこれ(原作の方 : 88207130)である。現在、リンク番号は13億突破してるのに対しこの作品は1億すらいっていない。<br>
        なぜそうしようと思ったのか...それは完全なるMKの気まぐれと古参アピールのためである。なんて野郎だ。
    `,``,`<a href="https://www.youtube.com/watch?v=bmbAm-fKnbQ" target="_blank" rel="noopener noreferrer">
            [Atena] クローンクローン / GUMI, 鏡音リン</a>`)),

    createGames("BE10　★10 + 3" , gameURL("228396018","IMS","","ScDeprecated")+gameDesMKRS(`2679`,`電極、電極スイッチ、振り子(8種類)、状態編集 (BE9比較)`, difficulty("通常","MKRSstar",13)+ difficulty("全回収","none",) ,`
            電極、電極スイッチ、振り子(8種類)、状態編集　追加<br>
            <br>
            今回、ついに難易度が限界突破しました...難所だらけの鬼畜ステージ　さらにBGMはフルバージョンで5分超え!　もちろんチェックポイントなし!　こんなの誰がクリアできる!?<br>
            <br>
            最初は簡単だけどね。一応難所を伝えておく。まあ知ったところで難しいことに変わりはないから、全く役には立たないけどね★<br>
            1番パートでは32%～40%<br>
            2番パートは...52%～71%　(ほかにもあるけど。)<br>
            が特に難しい。ボーカルが全部終わっても最後まで油断できません。一応キー操作がBE9で改善されたから、タブレット勢はクリアしやすいのかもしれない。知らんけど。
            おかしいくらいの難易度だよ。____________くらい難しいよ。バカゲーだよ。むりげーだよ。アホゲーだよ。覚えゲーだよ。マジキチゲーだよ。超死にゲーだよ。ゴミゲーだよ。
            1重バリアでクリア出来たら、ぼるころ検定初段は余裕で受かるんじゃないかな。しかも今作、52%から73%にかけてはTASテクニックを使わないと突破できない場所もあるよ。
            うん、ク★ソ★ゲ★ー (TAS必須はN7以来)　まあ...あの時と違って判定は甘めなんだけど...<br>
            <br>
            2026/06/19追記　このステージはBE14が投稿された現時点で、通常ルートがBEシリーズの中で最も難しいことで知られている。<br>
            高速移動やTASが割と要求されるためであり、しかもそいつらは後半に固まっているため譜面研究しようとする人を容赦なく追い詰めていく。<br>
            また、その難しさから「ビートころころ」のラスボスと呼ばれることも。<br>
            ちなみに他のシリーズだと通常ルートがこれ並み、あるいはより難しいステージがいくつか存在する。BA3,BA6,BΕ15など。お前らだお前ら。
    `,``,`[Masayoshi Minoshima] Bad Apple!! feat.nomico`)),


    createGames("BE11　★3" , gameURL("228311037","","","ScDeprecated")+gameDesMKRS(`690`,`木の板、星、金の星 (BA2比較)`, difficulty("通常","MKRSstar",3)+ difficulty("全回収","MKRSstar",10) ,`
            最近ラグが深刻な問題となっている。このままではガガガ... プシュー... オモイ...　の一途をたどってしまうかもしれない。このラグを改善する方法はないのか!?<br>
            今回は初心者でも攻略しやすい程度の難易度に落ち着かせた。あと適当に済ませた。以上。<br>
            あ、でも、星を全回収するなら話は別。やれるもんならやってみんしゃい。特に2個目の金星は難しい。<br>
            作者は通常ルートならクリア、全回収は2025/09/14に初達成　ここまで長かった...<span class="lo">(全回収ワンチャン★11に昇格する可能性もあった。)</span><br>
            <br>
            //木の板について補足<br>
            これはほぼ、ただの効果音用のギミック<br>
            というのも、ぶつかってもギミックが壊れるだけで、ボールに何もダメージを与えることはないからだ。ちなみに木の板は当たり判定をどんな設定にしようが、ヒットボックスの大きさが1×1で固定だ。
            ちなみに星の判定も同様の形式のため、ちゃんと通らないとうっかりTASって星をすり抜ける、なんてことになるので注意
    `,``,`[東方] 無何有の郷`)),

    createGames("BE12　★9" , gameURL("","","","ScDeprecated")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),
    createGames("BE12.1　★2" , gameURL("","","","ScDeprecated")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("BE13　★10" , gameURL("224433012","IMS","","ScDeprecated")+gameDesMKRS(`2260`,`ハザードタイル、スーパーハザードタイル、ハンマーの柔軟性、レーザーの柔軟性、横レーザー、高いレーザー、高い横レーザー、極太レーザー、レーザーが出ないレーザー、ウェーブの柔軟性v2、シフト床、ライブレーザー (BE9.1比較)`, difficulty("通常","MKRSstar",10)+ difficulty("全回収","MKRSstar",12) ,`
            ハザードタイル、スーパーハザードタイル、ハンマーの柔軟性、レーザーの柔軟性、横レーザー、高いレーザー、高い横レーザー、極太レーザー、レーザーが出ないレーザー、ウェーブの柔軟性v2、シフト床、ライブレーザー追加(※BE9.1比較)<br>
            <br>
            改めて追加ギミック全部書いてみるとエグイことをしてたんだな僕は...ちなみにこんだけギミック増やしておいて、総ブロック数はBE9.1と比べて240ブロック増えた程度である。軽量化頑張ったんやで。
            (パフォーマンス?　なにそれ。)<br>
            <br>
            さて...肝心の難易度は...★6にしたかったのになぁぜこんなむずくなったんだろうなー笑　★10にふさわしい難易度高めのコースが登場、君はクリアできるかな?
            全回収するならさらに高度なテクニックが要求されるぞ!　(ただし、BE12の全回収の方がムズイ...?　全て間奏のキー操作のせいである。)<br>
            また...初見殺しも非常に多いです。スピードが速い中複雑な地形を捌く必要があります。
            さらに新ギミックハザードタイルはTAS乗りを防止する厄介なギミックです。(緩い判定が効かない。)
            しかもこれの上位互換であるスーパーハザードタイルは触れると即死です。
            (ﾀﾋの踊り、バッテンに次ぐ即死ギミックが登場)
            これらは判定難の構成要素にも化ける可能性があり、注意が必要。
            でも、このコース視認難要素はほとんどなく、テクニックと練習回数が物を言う実力をつけるのにぴったりなコースだ。
            これを極めればいつかビートころころの現ラスボスことBE10を1バリアでクリアできるかも!?　あと原曲を2ループ使ってるため滅茶苦茶長い。気を付けて。
            MKは1バリアクリア達成済み。(attempt7、★4)　全回収も4バリアで達成済み。あと細かい仕様変更なんだけど、カナアミの上ではジェットパックは下に落ちるようになったよ。これを利用した星ルートもあるので油断できません。<br>
            <br>
            そんなBE13だが、コースのネタがないのはマジの本当だったため、いくつかのコースから地形をパクらせていただいております。<br>
            本家ローリングスカイから3ステージ(ただしそのうちの1つはあまり似てない。)<br>
            Scratchのボールころころから4ステージ<br>
            です。コメントで全部当てたら賞金0円!　自分のコースが途中に見えたらニヤけてくださいね笑笑笑<br>
            <br>
            あと3DくまころころのギミックはBE13でお別れとなります...弔いましょう...　一応サブレベルにはちょくちょく顔を出してくれるらしいですけどね。今回ライブレーザーを追加したのはその悪あがきだったという訳だ...<br>
            <br>
            今回ギミックも大量追加したけど、システム面でもいろいろ更新をしました。例えばバリアの無敵時間が変更できるようになりました!
            また、スコアアタックモードである「IMSリーグ」も追加。「挑戦モード」欄から設定できる。IMSリーグの詳しいルールは「設定」でIMSリーグモードにしたのち「遊び方」欄へどうぞ。
            (いつもと違う文章になってます。)
    `,``,`[東方] 神さびた古戦場`)),
    createGames("BE13.1　★1" , gameURL("219590606","IMS","","ScDeprecated")+gameDesMKRS(`593`,`なし (BE13比較)`, difficulty("通常","MKRSstar",1)+ difficulty("全回収","MKRSstar",4) ,`
            追加されたもの : なし(※BE13比較)<br>
            <br>
            BE13が制作面でも難易度でも地獄だったので息抜きにサブレベルを作りました。久しぶりの難易度★1、やや詐称かもしれんけど簡単にしたよ。全回収もゲキムズではないよ。多少テクニック使うけど。作者は1重バリアで一発クリア、全回収は4回で達成だからホントに簡単だよ。(BE11の易化版と思えば...)<br>
            <br>
            あと今回は久しぶりにBGMリクエスト消化　@seisakusha-3978 からのリクエスト　東方妖々夢の「幽霊楽団～Phantom Ensemble」でお届けします。<br>
            さらに今回は3Dくまころころのギミックがメインです。しばらくメインレベルでリストラになるので彼らには頑張ってここで登場してもらいました。あと簡単ではあるけどスーパーハザードタイルがあちこちに散らばってるのでうっかり踏んで一撃爆散しないように気を付けてね。<br>
            <br>
            以上!　グッドラック!
    `,``,`[東方] 幽霊楽団～Phantom Ensemble`)),
    createGames("BE13.2　★3" , gameURL("","","","ScDeprecated")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),
    createGames("BE13.3　★5" , gameURL("","","","ScDeprecated")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),
    createGames("BE14　★5" , gameURL("228535443","IMS","","ScDeprecated")+gameDesMKRS(`582`,`急速上昇下降塔、急速下降上昇塔、ボール状態変化　ルール逆転、ボールとカメラの分離 (REM5比較)`, difficulty("通常","MKRSstar",5)+ difficulty("全回収","MKRSstar",7) ,`
            追加されたもの : 急速上昇下降塔、急速下降上昇塔、ボール状態変化　ルール逆転、ボールとカメラの分離　(※REM5比較)<br>
            <br>
            せかせか急かされて、わずか9日で、急ピッチでギミック製作し、急ピッチでコース作りました。今回が長いコースだったらもう製作の労力が絶望以外の何物でもなかっただろう。助かったー!<br>
            ええと...　一つお詫びがあります。超絶認識難が凄まじいステージができました。BPMは終始155の半取りで速度が遅く、時間長も1ループだけ取っているため短いのですが...それをひっくり返しかけるレベルには認識難が激しいです。なんでかっていうと...今回追加したギミックがあまりにも複雑な仕様で、これを応用した配置を短いステージに大量に散りばめようとした結果こうなりました。
            難易度は★5/★7としてありますがこれはMKから見た話。譜面研究してない人にとってはその数字以上の地獄が待っていることは覚悟した方がいいと思います。特に金星はルートがイカレており、出現のトリガーは存在しない代わりに、今回新しく登場したギミックを惜しみなく使った難解なルートとなっています。他のステージと違って低速のため地力要求は低いですが、かわりに今までIMSのコースで培ってきた知識と勘、そして頭脳がないとルートを見つけられないレベルです。難解すぎてズルートあるかも笑
            模範リプレイを見ずにノーダメ全回収出来たらまじですごいです。頑張ってください。<br>
            <br>
            あとBE14.1以降ではこのギミックたちの出番は激減させるのでご承知おきください。これをガチで応用しようとすると超難解トリック譜面ができちゃうもん。<br>
            MKは3回でノーダメージ全回収クリア<br>
            <br>
            このステージ、これでもBE13.1を押しのけてBEシリーズのz長ワースト2位になったんだよね...　ただまぁ...そうは思えないほどには難しい。うん。<br>
            <br>
            <br>
            <br>
            //新ギミックについて補足<br>
            ・急速上昇下降塔<br>
            サムネにも映っている、ピンク色の矢印で描かれた急速塔の亜種。　地面にいる時は上昇、ジャンプ中は下降の役割になる。<br>
            <br>
            ・急速下降上昇塔<br>
            青色の矢印で描かれた急速塔の亜種。　地面にいる時は下降、ジャンプ中は上昇の役割になる。<br>
            <br>
            ・ボール状態変化　ルール逆転<br>
            今まで追加されてきた八芒星のようなボール状態変化系ギミックとは異なる形状をとる。触れると判定に関する一部のルールが逆転する。<br>
            <br>
            ===逆転するルール一覧===<br>
            ・床⇔ジャンプ床<br>
            ・ネオンフロア⇔ジャンプネオンフロア<br>
            ・脆い床⇔カナアミ<br>
            ・小ジャンプ⇔大ジャンプ<br>
            ・スピードアップ床⇔スピードダウン床<br>
            ・3倍スピードアップ床⇔ハイパースピードダウン床<br>
            ・ハザードタイル⇔スーパーハザードタイル<br>
            ・シフト床(左)⇔シフト床(右)<br>
            ・橙床⇔青床<br>
            ・障害物ブレイカー⇔オブジェクトデリーター<br>
            ・急速上昇塔⇔急速下降塔<br>
            ・急速上昇下降塔⇔急速下降上昇塔<br>
            ・二択ゲート(正解)⇔二択ゲート(不正解)<br>
            ・ボール状態変化　通常⇔ボール状態変化　反転<br>
            ・ボール状態変化　タップ操作⇔ボール状態変化　キー操作<br>
            ・ジャンパー力⇔障害物破壊力<br>
            <br>
            ===影響しないタイル、判定例===<br>
            ・ムーバー<br>
            ・破壊判定を持つ立体全般<br>
            ・ボール状態変化　不動<br>
            ・ボールコンディション　スワッパー<br>
            ・ジェットパック<br>
            ・フライモード<br>
            ・星<br>
            <br>
            なお、ボール状態変化　ルール逆転自体にも実はバリエーションがあり<br>
            >印の有無 (3パターン)<br>
            ・無...触れるたびにルール逆転<br>
            ・+マーク...触れると通常とは逆のルールに<br>
            ・-マーク...触れると通常のルールに<br>
            >判定範囲 (3パターン)<br>
            ・自分1マスのみ判定あり<br>
            ・自分のいるzすべてに判定あり<br>
            ・自分のいるzすべてに高さ4つ分の判定あり<br>
            <br>
            を複合的に合わせた9種類が存在する。<br>
            ...ここまで聞いてくれた人なら分かると思うが、このギミック自体非常に難解な存在である。そりゃあ譜面も認識なーんになるわな。まあ、仕様は実際にプレイするとすぐ覚えられるよ!
    `,``,`[東方] 春の湊に`)),
];



const li_MKBC_BA=[
    createGames("BA1　★2" , gameURL("","","","ScDeprecated")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("BA2　★4" , gameURL("","","","ScDeprecated")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("BA3　★10 + 65" , gameURL("","","","ScDeprecated")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("BA4　★10" , gameURL("","","","ScDeprecated")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("BA5　★10　longstage22" , gameURL("1188793356","","","ScDeprecated")+gameDesMKRS(`3600 (1200×3)`,`ムーバー、タイル連結、視覚状態変化　暗水色・暗黄色・暗ピンク、横槍、その他多すぎて計算不能 (BA4比較)`, difficulty("通常","MKRSstar",10)+ difficulty("全回収","MKRSstar",13) ,`
        番外編第5弾「このバグり散らかした世界に祝福を!」<br>
        <br>
        ===概要===<br>
        [まず謝罪] <br>
        はい、2か月以上も待たせてすみませんでした。でもそれに見合うクオリティにはなったと思います。<br>
        <br>
        [ここからちゃんと概要]<br>
        はい、実にN35以来のlongstageです。番号にすると22個目のlongstageですね。ちなみにN40とBA4はlongstageじゃないです。これを機に覚えよう。<br>
        <span class="lo">(ちなみに7月25日にlongstageが題名に付いてないことにやっと気づいたので直しました。)</span><br>
        まあ題名通り、今作はとにかくバグり散らかしており、まあなんかいろいろ吹っ切れます。また、前作と比較してあり得ないほどの種類のタイルが追加されています。なおほとんどは破壊判定のみ持つ障害物です。
        あ、でも油断はしないでね?　バッテンはLINES CONNECTION2の世界から逆輸入されたからね。他にも別の世界線のギミックがあったり...<br>
        <br>
        記念すべきタイル連結とムーバー初登場ステージがこんなんでいいのだろうか。ちなみにムーバーはほぼ全域で暴走します。特に全回収ルートでの暴走具合がやばいです。<span class="lo">(しかも2nd金星が過去一のイカレ具合を見せてます。)</span><br>
        え、最初はS9-4の10とほぼ同じだって?「ずっとそうであったらよかったですね。しかし、それではつまらない。」<br>
        <br>
        「そうか...これは一種の催眠だったのか...」<br>
        <br>
        こんなふざけ吹っ切れた問題作でありながらMKぼるころでワンチャンBE9に勝てるかもしれない力作です。腕に自信のある人は全回収してみてね!　あとズルルートもどんどん開拓してね!
        ちなみに今作はオマージュたっぷりな隠し要素を含んでます。そちらもお楽しみに。アンロックできればだけど。　コース中にヒントがあるよ!(追加された銀実績のこと。)<br>
        ちな、金実績も2個追加されてるけどこちらは常設になるのでよろしく。<br>
        <br>
        ===<br>
        分類 : 奇抜なテーマ、コラボ<br>
        あなた段々眠くなる浅はかな催眠術...<br>
        <br>
        <br>
        <余談><br>
        このステージ、改めていろいろ特異すぎる。<br>
        ・Two Dotsの音楽を使用(しかも3つも)<br>
        ・使用音楽数が多すぎる(9曲)<br>
        ・longstageだけで切り取れば長さはN35と同率1位<br>
        ・タイルの種類多すぎてMKも覚えきれてない。<br>
        ・偉大なるムーバーとタイル連結を生み出すという革命を起こした。<br>
        ・無駄に長い隠し要素がある。<br>
        <br>
        どこかの黒星の配置がデジマト3rdに似すぎてる気がする...<br>
        ちなみに本家RollingSkyの個人的好きなBGMランキングtop5を作りました。こちらです! 持ってないけど!<br>
        <br>
        1st : マイクロチップ<br>
        2nd : 電子迷宮<br>
        3rd : 盛典パレード(エイプリルフールver)<br>
        4th : デジタルマトリクス<br>
        5th : 日食<br>
        <br>
        以上!!!! (なお、2026年6月時点でランキングはかなり変動してる。)<br>
        このコースで追加されたギミックを全部言いたい人はコメ欄埋めてもいいのでできるだけ言ってみてください。しかし作者は何も返せません。なぜなら作者も全部把握できてないから。
        ちなみに、次回作で今作追加したギミックの半分以上のはリストラを喰らいます。データ容量食うし雰囲気の問題もあるし。笑　
        それで話はおしまい?　ならば<br>
        <br>
        「もう　こないからねー」
    `,``,`
[東方] 神々が恋した幻想郷<br>
[東方] 厄神様の通り道<br>
<a href="https://maou.audio/bgm_piano21" target="_blank" rel="noopener noreferrer">
[魔王魂] ピアノ21</a> <br>
[ローリングスカイ] 洞窟 (改変して使用)<br>
[Leaf & Optie] もぺもぺ (改変して使用)<br>
<a href="https://www.youtube.com/watch?v=19y8YTbvri8" target="_blank" rel="noopener noreferrer">
[サツキ] メズマライザー / 初音ミク・重音テトSV</a> (改変して使用)<br>
[Two Dots] level 2301~2400 (in level)<br>
[Two Dots] level 5651~5740 (in level)<br>
[Two Dots] level 6371~6460 (in level)`)),


    createGames("BA6　★10 + 30" , gameURL("","","","ScDeprecated")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),
    createGames("BA6.1　★1" , gameURL("","","","ScDeprecated")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("BA7　★∞" , gameURL("","","","ScDeprecated")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("BA8　★10" , gameURL("","","","ScDeprecated")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),
];



const li_MKBC_REM=[
    createGames("REM1　★8　([3D]4)" , gameURL("","","","ScDeprecated")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("REM2　★10　(BKR54)" , gameURL("","","","ScDeprecated")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("REM3　★10　(BKR57)" , gameURL("","","","ScDeprecated")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("REM4　★10　(BKR55)" , gameURL("","","","ScDeprecated")+gameDesMKRS(`--`,`--`, difficulty("通常","MKRSstar",)+ difficulty("全回収","none",) ,`
            ※このリンク先はMKが更新するのを面倒くさがったため使えません。次回更新をお待ちください。
    `,``,`--`)),

    createGames("REM5　★6　(N13)" , gameURL("1321035394","IMS","","ScDeprecated")+gameDesMKRS(`600`,`なし (合作II-1比較)`, difficulty("通常","MKRSstar",6)+ difficulty("全回収","none",) ,`
        N13消されて悔しかったのでIMSで復活しました。なんで消されたかと言うと、何も報告乱用ではありません。無変更リミックスと間違えられたからです。悔しいいいい。<br>
        N13は雨が降ったりといった特殊な演出をNシリーズながら含んでいる、かなり特異な方のステージでした。作者も好きだし復活を望む声がそれなりにあったので...んで、今日、元気坊主の言葉に背中を押され、N13はREM5として復活を遂げました!　やったー<br>
        では...あのセリフをまた言うとしますか。それでは...<br>
        <br>
        「雨日のボールころころはいかが?」<br>
        <br>
        コース自体は一から再構成したのでちょっとだけオリジナルと違うかもしれません。<br>
        元のN13は★9だったので3段階降格してます。判定が緩くなったのもそうですが若干レギュレーションが変わった影響の方が大きいです。
    `,``,`[東方] 東方原曲　月時計〜ルナ・ダイアル〜`)),
];



const li_MKBC_BΕ=[
     createGames("BΕ15　★5" , `原作<br>`+gameURL("1294832339","IMS","","ScDeprecated")+`copy version<br>`+gameURL("224604626","IMS","","ScDeprecated")+gameDesMKRS(`2670`,`なし (BE13.3比較)`, difficulty("通常","MKRSstar",13)+ difficulty("全回収","MKRSstar",17) ,`
            追加されたもの : なし(※BE13.3比較)<br>
            <br>
            とってもかんたんで、たのしいステージだよ!　作者は2回でノーダメージ全回収クリア。　みんな頑張ってね^^<br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            なーんて、エイプリルフールの日にそれが本当だとでも思ったかい?<br>
            原作を見た人なら分かると思うけど、これ、バリバリのトロールコースだよ！！！！ <span class="lo">(何気にIMS史上初)</span><br>
            原作の方に書いてあった難易度表示(★5)も、安心させるための嘘だよ！！！！　<span class="lo">(原作の難易度表示が本当だったら超詐称である。)</span><br>
            ちなみに、本当のMKの最高記録は数十回やって1バリアで84%、黒星9、金星2です。この後に作者ができないレベルの超技術難&認識難ゾーンがある...のだがなぜか1バリア全回収が2人も出ているという謎...本当になんで?????<br>
            地味に結構凝った譜面になった。さあ、皆も嘘に踊ろう!　ちなみに原作の方では、簡単に譜面研究されないようにエディターと模範解答リプレイのデータを破壊し、エイプリルフールらしい演出を代わりに入れました。<br>
            こんな感じのやつを毎年のエイプリルフールに出そうかな...と思ってます。時間があればな。
    `,``,`<a href="https://www.youtube.com/watch?v=UHbmkxv-874" target="_blank" rel="noopener noreferrer">
            [マサラダ] ライアーダンサー／重音テトSV</a>`)),
     createGames("BΕ15.1　★10" , gameURL("223056735","IMS","","ScDeprecated")+gameDesMKRS(`8239`,`なし (BΕ15比較)`, difficulty("通常","MKRSstar",10)+ difficulty("全回収","MKRSstar",14) ,`
            追加したもの : なし(※BΕ15比較)<br>
            <br>
            現在進行形で長さのインフレが起きております。ヤバいです。原曲のぴったり5分をそのまま使用しており下手すれば時間長がBE10を超えたかもしれないです。笑<br>
            勿論のこと、激唱なので高速パートが例にもれず存在します。速度面ではBE13.3よりは優しい(最高BPM400)ですが、代わりに配置がより凶悪になってます。金星はどれも難しいですが特に2ndがヤバいです。正直言って取らせる気はありません。<br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            <br>
            だ っ て 、こ の 作 品 そ も そ も ボ ー ル こ ろ こ ろ で す ら な い の だ か ら 。<br>
            星なんてものあるわけないじゃん。(中身クリッカーRPGです...あれ、なんか変だぞ...?)<br>
            <br>
            <div class="teller MK">
                う、うわああああ
            </div>
            <div class="teller n">
                <span class="hi">＊えむけー　死亡確定!</span>
            </div>
            <div class="teller 望月　夕">
                裏切者サバイバルのボイスじゃんｗｗ
            </div>
            <div class="teller 神渚　暁音">
                まあ無事エイプリルフール2本立て完遂できてよかったね。
            </div>
            <div class="teller MK">
                ほんとそうだよー大変だった―
            </div>
            <div class="teller 望月　夕">
                結局あんた生きてたのかよ。
            </div>
    `,``,`<a href="https://www.youtube.com/watch?v=MFEaIgMkR_0" target="_blank" rel="noopener noreferrer">
            [cosMo@暴走P] 初音ミクの激唱 / feat.初音ミク</a>`)),
];



const li_MKBC_J=[
    createGames("J1　★4　(2026/06/21)" , gameURL("","","MK　ジャーニーころころ1.sb3","")+gameDesMKRS(`1871`,`なし (BE14比較)`, difficulty("通常","MKRSstar",4)+ difficulty("全回収","MKRSstar",6) ,`
        さあさあついに始まってまいりました。「MK　ジャーニーころころ」ことJシリーズ。<br>
        このシリーズではIMSエンジンを用いて、自分の気の向くままに好きな曲でころころを作っていきます。実質ビートころころかもしれないけど、まあ音ハメは別にしなくていいんですよね。<br>
        ちなみに以下が当シリーズの特徴となっています。<br>
        <br>
        ・MKの保管庫からダウンロードすることによってのみプレイ可能<br>
        ・音ハメは別にしなくてもいい。(ビートころころじゃないから)<br>
        ・「破壊判定のみ持つ立体」以外のタイルの追加は原則なし。(本家共創のようなルール)<br>
        ・随所にチェックポイントがある。どれだけ置いてあるかはMKのさじ加減次第となる。<br>
        ・longstageがあるが5ステージに一度ではなく不定期に訪れる。<br>
        etc...<br>
        <br>
        <br>
        今作はそんな記念すべきJシリーズの1作目です。1作目にしては割とやばい譜面ができました。コースがなんと原曲フル尺の約4分あります。(は?)<br>
        MKはどうしてもボカロ曲になるとフル尺で作りたくなってしまうのです。4分っていうとBE13.3と同じくらい長いです。ちな書いてて気づいたんだけど、こいつz長BE6より長いんだぜ?　マジで言ってる?　
        難易度の方は★4/★6で抑えめですが物量と初見殺しがなかなかなものとなっています。また今回は使うタイルをある程度絞ってコースを作ってみました。その結果割と統一感
        のある綺麗な譜面に...なれたかなぁ...?　物量のせいでちょっと怪しいけど笑<br>
        MKはノーダメージ全回収フルランしたよ。みんな頑張ってね。<br>
        <br>
        あと何気にTIMELINE形式でのチェックポイントが実装されました。<br>
        しかも、「詳細」欄からスタートするチェックポイントを自由に変更できるようにパワーアップしました!　
        一度踏んだCPのみ、Z POSITIONゲージの該当する太い部分をクリックすると、スタート位置を変更できます。なお模範リプレイに限り最初から全てのCPが使えます。
        開発段階ですごいバグり方をするので大変でしたがなんとかモノにできました。ちなみにチェックポイントから始めてもBGMはしっかり同期しますのでご安心を。<br>
        <br>
        え、マイリプレイは流石に直しただろって...?　 ...助けてください直し方が分かりません。(作者が分からないなら終わりだよ。)<br>
        追記 : <a href="taru-ru" rel="noopener noreferrer">@taru-ru</a> さんの頑張りのおかげでなんとか一時的な修正に至りました!　マジ感謝!<br>
        そして誰ですか共有日をワールドカップのチュニジア戦と重ねた人は。(←お前だよ。)　猛者共よ、中継が始まる前に全回収してみるがいい!<br>
    `,``,`<a href="https://www.youtube.com/watch?v=FRSfnD3k_ts" target="_blank" rel="noopener noreferrer">
        [40mP] ドリーマーズビート feat.初音ミク</a>`)),
];



const li_MKBC_K=[
];



const li_MKBC_longstages=[
    li_MKBC_H[4],
    li_MKBC_H[9],
    li_MKBC_H[14],
    li_MKBC_H[19],
    li_MKBC_H[24],
    li_MKBC_H[29],
    li_MKBC_H[34],

    li_MKBC_B[4],
    li_MKBC_B[9],

    li_MKBC_O[4],
    li_MKBC_O[9],
    li_MKBC_O[14],
    li_MKBC_O[19],
    li_MKBC_O[24],

    li_MKBC_N[4],
    li_MKBC_N[9],
    li_MKBC_N[13],
    li_MKBC_N[18],
    li_MKBC_N[23],
    li_MKBC_N[28],
    li_MKBC_N[33],

    li_MKBC_BA[4],
];



document.getElementById("MKBC_H").innerHTML=
    gameTable("Hシリーズ一覧",li_MKBC_H,`` );

document.getElementById("MKBC_B").innerHTML=
    gameTable("Bシリーズ一覧",li_MKBC_B,`` );

document.getElementById("MKBC_O").innerHTML=
    gameTable("Oシリーズ一覧",li_MKBC_O,`` );

document.getElementById("MKBC_N").innerHTML=
    gameTable("Nシリーズ一覧",li_MKBC_N,`注.　N13は無変更リミックス誤認の報告により削除されています。代わりにREM5をお試しください。` );

document.getElementById("MKBC_BE").innerHTML=
    gameTable("BEシリーズ一覧",li_MKBC_BE,`` );

document.getElementById("MKBC_BA").innerHTML=
    gameTable("BAシリーズ一覧",li_MKBC_BA,`` );

document.getElementById("MKBC_REM").innerHTML=
    gameTable("REMシリーズ一覧",li_MKBC_REM,`` );

document.getElementById("MKBC_BΕ").innerHTML=
    gameTable("BΕシリーズ一覧",li_MKBC_BΕ,`` );

document.getElementById("MKBC_J").innerHTML=
    gameTable("Jシリーズ一覧",li_MKBC_J,`` );



document.getElementById("MKBC_longstages").innerHTML=
    gameTable("歴代longstage一覧",li_MKBC_longstages,`` );




   